// Smallest Range I 908.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <vector>
#include <algorithm>

using namespace std;

int smallestRangeI(vector<int>& A, int K) {
	int minV = INT16_MAX;
	int maxV = INT16_MIN;
	for (int i = 0; i < A.size(); i++) {
		minV = min(minV, A[i]);
		maxV = max(maxV, A[i]);
	}
	return max(0, maxV - minV - 2 * K);
}

int main()
{
	vector<int> input = { 0, 10 };
	int k = 2;
    std::cout << "6 == "  << smallestRangeI(input, k); 
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
